{
    "candle/Data/Images/Normal/0000.JPG": "The anomaly in the picture is that one of the candles has a wick sticking out of it, while the other three candles do not have wicks.",
    "candle/Data/Images/Anomaly/000.JPG": "The anomaly in the picture is that one of the candles has a wick that is not straight, which is different from the other candles.",
    "candle/Data/Images/Anomaly/005.JPG": "One of the candles has a small crack in the side.",
    "candle/Data/Images/Anomaly/006.JPG": "One of the candles has a small crack in it.",
    "candle/Data/Images/Anomaly/010.JPG": "The anomaly defect in the picture is that one of the candle holders has a visible hole in it.",
    "candle/Data/Images/Anomaly/017.JPG": "The candles are all white, except for one that is black.",
    "candle/Data/Images/Anomaly/030.JPG": "The anomaly defect in the picture is that one of the candles has a wick that is not fully visible, as it is partially obscured by the other candles.",
    "candle/Data/Images/Anomaly/034.JPG": "The anomaly defect in the picture is that one of the candles has a wick that is not lit, while the other three candles have lit wicks.",
    "candle/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is that one of the candles has a red dot on it, which is not present on the other candles.",
    "candle/Data/Images/Anomaly/044.JPG": "The anomaly defect in the picture is that one of the candles has a black mark on it, which is not present on the other candles.",
    "candle/Data/Images/Anomaly/050.JPG": "The anomaly defect in the picture is that one of the candles has a number 7 on it, which is not typical for candles.",
    "candle/Data/Images/Anomaly/053.JPG": "The candle on the left has a pink spot on it, which is an anomaly compared to the other candles.",
    "candle/Data/Images/Anomaly/056.JPG": "The anomaly defect in the picture is that one of the candles has a wick that is not fully visible, while the other candles have their wicks fully visible.",
    "candle/Data/Images/Anomaly/060.JPG": "The anomaly defect in the picture is that one of the candles has a slightly different shape, making it stand out from the other three candles.",
    "candle/Data/Images/Anomaly/069.JPG": "The candles in the image have a defect, as they are all missing their wicks.",
    "candle/Data/Images/Anomaly/070.JPG": "The anomaly in the picture is that one of the four white candles has a black spot on it, which makes it stand out from the other three candles.",
    "candle/Data/Images/Anomaly/071.JPG": "The anomaly defect in the picture is that one of the candles has a hole in it.",
    "candle/Data/Images/Anomaly/081.JPG": "The candle on the left has a black spot on it.",
    "candle/Data/Images/Anomaly/085.JPG": "The candle on the right has a small hole in it.",
    "candle/Data/Images/Anomaly/092.JPG": "The anomaly defect in the picture is that one of the candles has a wick that is not fully visible, as it is partially covered by the candle.",
    "cashew/Data/Images/Normal/000.JPG": "The peanut is cracked, which is an anomaly defect in the picture.",
    "cashew/Data/Images/Anomaly/000.JPG": "The peanut in the image has a small black spot on it, which is an anomaly defect.",
    "cashew/Data/Images/Anomaly/001.JPG": "The peanut in the image has a blemish on it, which is an anomaly defect.",
    "cashew/Data/Images/Anomaly/009.JPG": "The peanut in the image has a small blemish or spot on it.",
    "cashew/Data/Images/Anomaly/012.JPG": "The peanut is cracked on the side.",
    "cashew/Data/Images/Anomaly/025.JPG": "The anomaly in the picture is a small black spot on the peanut.",
    "cashew/Data/Images/Anomaly/032.JPG": "The peanut in the image has a bite taken out of it.",
    "cashew/Data/Images/Anomaly/037.JPG": "The peanut in the image has a hole in it.",
    "cashew/Data/Images/Anomaly/038.JPG": "The anomaly in the picture is a small hole in the middle of the peanut butter sandwich cracker.",
    "cashew/Data/Images/Anomaly/042.JPG": "The peanut in the image has a hole in the center.",
    "cashew/Data/Images/Anomaly/044.JPG": "The peanut in the image is not a perfect circle, but rather has a slightly odd shape.",
    "cashew/Data/Images/Anomaly/046.JPG": "The peanut has a black spot on it, which is an anomaly defect.",
    "cashew/Data/Images/Anomaly/055.JPG": "The peanut has a small black spot on it.",
    "cashew/Data/Images/Anomaly/058.JPG": "The peanut is cracked in half, which is an anomaly defect.",
    "cashew/Data/Images/Anomaly/078.JPG": "The peanut in the image has a small hole in it.",
    "cashew/Data/Images/Anomaly/092.JPG": "The peanut in the image has a small hole in it.",
    "cashew/Data/Images/Anomaly/094.JPG": "The cookie has a bite taken out of it, making it look like a smiley face.",
    "fryum/Data/Images/Normal/000.JPG": "The anomaly defect in the picture is that the small white wheel is not a real wheel, but rather a fake or toy wheel.",
    "fryum/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is a small black spot on the white object, which is a piece of plastic.",
    "fryum/Data/Images/Anomaly/007.JPG": "The anomaly defect in the picture is that the white plastic wheel is placed on a green background, which is not the typical setting for a wheel.",
    "fryum/Data/Images/Anomaly/010.JPG": "The anomaly in the picture is that the round object, which appears to be a piece of candy or a small toy, is sitting on a green surface, but the object is not clearly visible. It is only partially visible, with a portion of it obscured by the green surface.",
    "fryum/Data/Images/Anomaly/016.JPG": "The anomaly in the picture is a small piece of the plastic wheel that has broken off.",
    "fryum/Data/Images/Anomaly/017.JPG": "The anomaly defect in the picture is the broken piece of the wheel, which is missing.",
    "fryum/Data/Images/Anomaly/020.JPG": "The anomaly defect in the picture is the presence of a small black spot on the center of the white wheel.",
    "fryum/Data/Images/Anomaly/026.JPG": "The anomaly defect in the picture is that the round object is described as a wheel and a plate, but it is actually a round piece of plastic with a hole in the center.",
    "fryum/Data/Images/Anomaly/028.JPG": "The anomaly defect in the picture is that the small round object, which is a white wheel or gear, is sitting on a green background that is not a part of the object.",
    "fryum/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is that the small round object, which appears to be a piece of candy or a decoration, is placed on a green surface, but there is no indication of the object's actual size or position relative to the surface.",
    "fryum/Data/Images/Anomaly/065.JPG": "The anomaly in the picture is the presence of a small hole in the middle of the white circle, which is an unusual feature for a round object.",
    "fryum/Data/Images/Anomaly/069.JPG": "The anomaly in the picture is a broken piece of plastic, which is not a part of the object.",
    "fryum/Data/Images/Anomaly/087.JPG": "The anomaly defect in the picture is a small hole in the center of the white plastic wheel.",
    "fryum/Data/Images/Anomaly/090.JPG": "The anomaly defect in the picture is the small white circle in the middle of the round object, which is not a typical feature of a wheel.",
    "macaroni1/Data/Images/Normal/0000.JPG": "In the image, the pasta shells are arranged in a neat row, but one of the shells has a defect, making it slightly different from the others.",
    "macaroni1/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is that one of the six macaroni shells has a crack in it.",
    "macaroni1/Data/Images/Anomaly/005.JPG": "The anomaly in the picture is that one of the pasta shells has a crack in it.",
    "macaroni1/Data/Images/Anomaly/022.JPG": "In the image, one of the pasta shells has a crack in it, which is an anomaly defect.",
    "macaroni1/Data/Images/Anomaly/023.JPG": "The anomaly defect in the picture is the presence of a small hole in one of the pasta shells.",
    "macaroni1/Data/Images/Anomaly/038.JPG": "One of the pasta shells has a hole in it, which is an anomaly compared to the other five shells.",
    "macaroni1/Data/Images/Anomaly/048.JPG": "One of the pasta shells has a yellow spot on it, which is an anomaly compared to the other five shells.",
    "macaroni1/Data/Images/Anomaly/055.JPG": "One of the pasta shells has a gold coin in it.",
    "macaroni1/Data/Images/Anomaly/071.JPG": "The image shows four macaroni shells, but one of them has a defect, making it different from the others.",
    "macaroni1/Data/Images/Anomaly/078.JPG": "The anomaly defect in the picture is that one of the four pasta shells is slightly different from the others.",
    "macaroni1/Data/Images/Anomaly/080.JPG": "The anomaly defect in the picture is that the four pasta shells are not all identical in shape.",
    "macaroni2/Data/Images/Normal/0000.JPG": "The anomaly defect in the picture is the broken yellow pasta shell on the green surface.",
    "macaroni2/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is that one of the pasta shells is broken in half.",
    "macaroni2/Data/Images/Anomaly/004.JPG": "The anomaly in the picture is a piece of yellow plastic that has a hole in it.",
    "macaroni2/Data/Images/Anomaly/010.JPG": "The anomaly in the picture is that one of the pasta pieces is broken in half.",
    "macaroni2/Data/Images/Anomaly/030.JPG": "The anomaly defect in the picture is that one of the pasta shells has a crack in it.",
    "macaroni2/Data/Images/Anomaly/045.JPG": "The anomaly defect in the picture is that there are four yellow pasta shells instead of the expected three.",
    "macaroni2/Data/Images/Anomaly/046.JPG": "There is a broken piece of a yellow pasta shell on the green surface.",
    "macaroni2/Data/Images/Anomaly/070.JPG": "The anomaly defect in the picture is the presence of a broken yellow pasta shell.",
    "macaroni2/Data/Images/Anomaly/071.JPG": "The anomaly defect in the picture is the presence of a half-eaten onion ring, which is not a part of the other whole onion rings.",
    "macaroni2/Data/Images/Anomaly/072.JPG": "The anomaly defect in the picture is that one of the yellow rings is broken in half.",
    "macaroni2/Data/Images/Anomaly/077.JPG": "The anomaly in the picture is that one of the pasta shells is broken in half.",
    "macaroni2/Data/Images/Anomaly/079.JPG": "In the image, there is a group of four yellow pasta shells, but one of them has a crack in it.",
    "macaroni2/Data/Images/Anomaly/080.JPG": "The anomaly in the picture is a broken piece of a yellow pasta.",
    "macaroni2/Data/Images/Anomaly/082.JPG": "The anomaly defect in the picture is that one of the pasta shells is broken in half.",
    "pcb1/Data/Images/Normal/0000.JPG": "The image is upside down, with the speaker and microphone components on the top and the bottom of the image.",
    "pcb1/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is that the right speaker is missing its cover.",
    "pcb1/Data/Images/Anomaly/009.JPG": "The anomaly defect in the picture is that the two speakers are not connected to any device or circuitry.",
    "pcb1/Data/Images/Anomaly/015.JPG": "The anomaly in the picture is the presence of a missing screw in the middle of the electronic device.",
    "pcb1/Data/Images/Anomaly/020.JPG": "The anomaly defect in the picture is that the speaker has a missing piece of the metal.",
    "pcb1/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is that the two speakers are not connected to any device or system, and they are placed on a gray surface.",
    "pcb1/Data/Images/Anomaly/041.JPG": "The anomaly defect in the picture is that the blue and white electronic device has a missing screw.",
    "pcb1/Data/Images/Anomaly/051.JPG": "The anomaly defect in the picture is that the two speakers are upside down.",
    "pcb1/Data/Images/Anomaly/053.JPG": "The speaker on the right has a small black spot on it.",
    "pcb1/Data/Images/Anomaly/085.JPG": "The image shows a close-up of a speaker with a blue board and a silver case, but there is no speaker in the image.",
    "pcb2/Data/Images/Normal/0000.JPG": "The anomaly defect in the picture is that the electronic device is missing a piece of its circuit board.",
    "pcb2/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is a small piece of wire sticking out of the electronic device.",
    "pcb2/Data/Images/Anomaly/001.JPG": "The anomaly in the picture is that there are two wires coming out of the electronic device, instead of the expected one or two.",
    "pcb2/Data/Images/Anomaly/015.JPG": "The anomaly in the picture is that the electronic circuit board has a missing pin.",
    "pcb2/Data/Images/Anomaly/033.JPG": "The blue and white electronic component has a yellow stain on it.",
    "pcb2/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is the presence of a small piece of dirt on the blue circuit board.",
    "pcb2/Data/Images/Anomaly/043.JPG": "The anomaly defect in the picture is a missing pin on the blue circuit board.",
    "pcb2/Data/Images/Anomaly/085.JPG": "The blue circuit board has a defect in the form of a missing component.",
    "pcb3/Data/Images/Normal/0000.JPG": "The anomaly defect in the picture is that there is a small black wire sticking out of the top of the blue and white electronic component.",
    "pcb3/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is that the blue and white electronic device has a missing screw.",
    "pcb3/Data/Images/Anomaly/006.JPG": "The anomaly defect in the picture is that the blue and black electronic component is not connected to the wires, which is unusual for a functional electronic device.",
    "pcb3/Data/Images/Anomaly/020.JPG": "The image is upside down, with the electronic device and its wires facing the wrong direction.",
    "pcb3/Data/Images/Anomaly/021.JPG": "The anomaly in the picture is that there is a small black dot on the green surface, which is not a part of the electronic device.",
    "pcb3/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is a small black spot on the green background.",
    "pcb3/Data/Images/Anomaly/045.JPG": "The image has a defect where the green background appears to be missing in the top right corner.",
    "pcb3/Data/Images/Anomaly/046.JPG": "The image is upside down, which is an anomaly defect.",
    "pcb3/Data/Images/Anomaly/048.JPG": "The anomaly defect in the picture is that the small electronic device has a missing screw.",
    "pcb3/Data/Images/Anomaly/080.JPG": "The anomaly defect in the picture is that there is a small hole in the middle of the blue and white electronic component.",
    "pcb4/Data/Images/Normal/0000.JPG": "The anomaly defect in the picture is that the blue and white electronic component is upside down.",
    "pcb4/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is the presence of dirt on the electronic component.",
    "pcb4/Data/Images/Anomaly/001.JPG": "The anomaly defect in the picture is a small black spot on the blue circuit board.",
    "pcb4/Data/Images/Anomaly/005.JPG": "The anomaly defect in the picture is that the blue and white circuit board has a missing screw.",
    "pcb4/Data/Images/Anomaly/006.JPG": "The anomaly defect in the picture is a small piece of a broken circuit board with a missing piece.",
    "pcb4/Data/Images/Anomaly/007.JPG": "The anomaly defect in the picture is that the image is upside down, with the electronic component and its connections displayed in reverse order.",
    "pcb4/Data/Images/Anomaly/008.JPG": "The anomaly in the picture is a small piece of metal or a wire that is sticking out of the electronic component.",
    "pcb4/Data/Images/Anomaly/010.JPG": "The anomaly defect in the picture is the presence of a small piece of metal or a screw sticking out of the electronic component.",
    "pcb4/Data/Images/Anomaly/016.JPG": "A small electronic component with a piece of dirt or debris in the middle of it.",
    "pcb4/Data/Images/Anomaly/017.JPG": "The anomaly defect in the picture is that the small electronic device has a missing screw.",
    "pcb4/Data/Images/Anomaly/022.JPG": "The anomaly in the picture is a broken pin on the electronic board.",
    "pcb4/Data/Images/Anomaly/024.JPG": "The anomaly defect in the picture is that the blue and white electronic component is upside down.",
    "pcb4/Data/Images/Anomaly/025.JPG": "The anomaly defect in the picture is a small piece of dirt on the blue circuit board.",
    "pcb4/Data/Images/Anomaly/029.JPG": "The anomaly defect in the picture is that the small electronic component is missing a screw, which is typically used to secure it to the circuit board.",
    "pcb4/Data/Images/Anomaly/030.JPG": "The anomaly defect in the picture is that the blue and white circuit board has a missing screw.",
    "pcb4/Data/Images/Anomaly/034.JPG": "The anomaly defect in the picture is the presence of a broken wire on the electronic component.",
    "pcb4/Data/Images/Anomaly/036.JPG": "The anomaly in the picture is a purple object sticking out of the electronic device.",
    "pcb4/Data/Images/Anomaly/045.JPG": "The anomaly defect in the picture is the presence of a single black screw on the blue circuit board, which is not typical for electronic components.",
    "pcb4/Data/Images/Anomaly/046.JPG": "The anomaly defect in the picture is that the close-up of the electronic device is not sharp, making it difficult to discern the details of the components.",
    "pcb4/Data/Images/Anomaly/047.JPG": "The anomaly defect in the picture is the presence of a single screw on the blue and white electronic component.",
    "pcb4/Data/Images/Anomaly/058.JPG": "The anomaly defect in the picture is that the electronic component is missing a screw.",
    "pcb4/Data/Images/Anomaly/075.JPG": "The anomaly defect in the picture is the presence of a small chip with a missing piece of it.",
    "pcb4/Data/Images/Anomaly/076.JPG": "The anomaly defect in the picture is the missing screw in the electronic component.",
    "pcb4/Data/Images/Anomaly/080.JPG": "The anomaly defect in the picture is that the small electronic device is missing a screw, which is typically used to secure it to a circuit board.",
    "pcb4/Data/Images/Anomaly/086.JPG": "The anomaly defect in the picture is that the blue circuit board has a missing screw, which is typically used to secure the board to a larger device or structure.",
    "pcb4/Data/Images/Anomaly/089.JPG": "The anomaly in the picture is that the electronic component has a missing pin.",
    "pcb4/Data/Images/Anomaly/090.JPG": "The anomaly defect in the picture is the presence of a small chip or electronic component on a black background, which is not the typical setting for such an object.",
    "pipe_fryum/Data/Images/Normal/000.JPG": "The anomaly defect in the picture is that the white object, which is a piece of soap, is placed on a black background. This contrasting color scheme makes the soap stand out prominently in the image.",
    "pipe_fryum/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is a small hole in the middle of the white cylinder.",
    "pipe_fryum/Data/Images/Anomaly/015.JPG": "In the image, there is a small white square object with a crack in it.",
    "pipe_fryum/Data/Images/Anomaly/030.JPG": "The anomaly defect in the picture is a hole in the middle of the white object, which is a piece of ivory.",
    "pipe_fryum/Data/Images/Anomaly/040.JPG": "The anomaly defect in the picture is a hole in the middle of the white object, which appears to be a piece of soap or a candle.",
    "pipe_fryum/Data/Images/Anomaly/041.JPG": "The anomaly in the picture is a crack in the middle of the white object, which appears to be a piece of wood or a broken piece of something.",
    "pipe_fryum/Data/Images/Anomaly/050.JPG": "The anomaly defect in the picture is the presence of a small hole in the middle of the white object.",
    "pipe_fryum/Data/Images/Anomaly/070.JPG": "The anomaly in the picture is that the white object, which is a piece of a candle, is sitting on a black background.",
    "pipe_fryum/Data/Images/Anomaly/074.JPG": "The anomaly defect in the picture is a small hole in the middle of the white object, which is a piece of cheese.",
    "pipe_fryum/Data/Images/Anomaly/087.JPG": "The white object in the image has a small black line running through it, which is an anomaly defect.",
    "pipe_fryum/Data/Images/Anomaly/090.JPG": "The anomaly defect in the picture is that there are three white objects, but only two of them are visible in the image.",
    "capsules/Data/Images/Normal/000.JPG": "The anomaly defect in the picture is that one of the green capsules is missing.",
    "capsules/Data/Images/Anomaly/000.JPG": "The anomaly defect in the picture is that one of the green capsules is missing, leaving a gap in the otherwise uniform arrangement of the other capsules.",
    "capsules/Data/Images/Anomaly/030.JPG": "One of the green capsules has a black spot on it, which is an anomaly compared to the rest of the capsules.",
    "capsules/Data/Images/Anomaly/045.JPG": "In the image, there is a green glass ball that is not perfectly round, which stands out among the other green glass balls.",
    "capsules/Data/Images/Anomaly/047.JPG": "There is one green glass ball that is different from the others, as it has a black spot in the middle.",
    "capsules/Data/Images/Anomaly/085.JPG": "There is one green pill that is slightly different from the rest, as it is not perfectly round and has a slightly different shape.",
    "chewinggum/Data/Images/Normal/000.JPG": "The white square object in the picture has a defect in it, making it appear as if it is not a perfect square.",
    "chewinggum/Data/Images/Anomaly/000.JPG": "A piece of white plastic with a hole in it is sitting on a black surface.",
    "chewinggum/Data/Images/Anomaly/001.JPG": "A piece of candy has a bite taken out of it, and there is a small piece of candy stuck in the bite mark.",
    "chewinggum/Data/Images/Anomaly/002.JPG": "The white object in the picture has a hole in it.",
    "chewinggum/Data/Images/Anomaly/005.JPG": "The anomaly in the picture is a bite taken out of the middle of the white candy bar.",
    "chewinggum/Data/Images/Anomaly/007.JPG": "The anomaly defect in the picture is a hole in the middle of the white object, which appears to be a piece of gum.",
    "chewinggum/Data/Images/Anomaly/016.JPG": "The white object in the image has a crack in it.",
    "chewinggum/Data/Images/Anomaly/030.JPG": "The anomaly in the picture is a piece of a white object, possibly a piece of a candy bar, with a bite taken out of it.",
    "chewinggum/Data/Images/Anomaly/032.JPG": "The white square object has a black spot in the middle of it.",
    "chewinggum/Data/Images/Anomaly/059.JPG": "The white object in the image has a hole in it.",
    "chewinggum/Data/Images/Anomaly/066.JPG": "A white bar of soap has a crack in it.",
    "chewinggum/Data/Images/Anomaly/075.JPG": "The white object in the image has a small hole in it.",
    "chewinggum/Data/Images/Anomaly/080.JPG": "The white object in the image has a small black dot on it, which is an anomaly defect.",
    "chewinggum/Data/Images/Anomaly/081.JPG": "The white object has a hole in the middle, which is an anomaly defect.",
    "chewinggum/Data/Images/Anomaly/085.JPG": "The white object in the image has a small black spot on it, which is an anomaly defect.",
    "chewinggum/Data/Images/Anomaly/093.JPG": "The white object in the image has a small hole in it."
}